In [1]:
#Libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import math

In [2]:
# data ---------------------------
df = pd.read_csv('satgpa.csv')

# equations ----------------------
def linear_cost(X, y, theta):
    h = X @ theta
    return ((h - y) ** 2).sum() / (2*len(X))

def linear_cost_gradient(X, y, theta):
    h = X @ theta
    return ((h - y).T @ X).T / (2*len(X))

def gradient_descent(
    X, y, theta_0, 
    cost_function, cost_function_gradient,
    learning_rate=0.01, 
    threshold=0.001,
    max_iter=1000
):
    theta = theta_0
    iteration = 0
    history = []
    while np.linalg.norm(cost_function_gradient(X, y, theta)) > threshold and iteration < max_iter:
        iteration += 1
        theta -= learning_rate * cost_function_gradient(X, y, theta)
        history.append(theta - learning_rate * cost_function_gradient(X, y, theta))

    return theta, history

In [3]:
df.head()

   sex  sat_v  sat_m  sat_sum  hs_gpa  fy_gpa
0    1     65     62      127    3.40    3.18
1    2     58     64      122    4.00    3.33
2    2     56     60      116    3.75    3.25
3    1     42     53       95    3.75    2.42
4    1     55     52      107    4.00    2.63

In [4]:
df.count()

sex        1000
sat_v      1000
sat_m      1000
sat_sum    1000
hs_gpa     1000
fy_gpa     1000
dtype: int64

In [7]:
#armamos las matrices para Gradient descent
x = df.copy()

In [9]:
y = np.array(df['fy_gpa']).reshape(len(x),1)

In [13]:
x.shape

(1000, 6)

In [14]:
y.shape

(1000, 1)

In [16]:
x
#Tenemos que remover las columns

     sex  sat_v  sat_m  sat_sum  hs_gpa  fy_gpa
0      1     65     62      127    3.40    3.18
1      2     58     64      122    4.00    3.33
2      2     56     60      116    3.75    3.25
3      1     42     53       95    3.75    2.42
4      1     55     52      107    4.00    2.63
..   ...    ...    ...      ...     ...     ...
995    2     50     50      100    3.70    2.19
996    1     54     54      108    3.30    1.50
997    1     56     58      114    3.50    3.17
998    1     55     65      120    2.30    1.94
999    1     49     44       93    2.70    2.38

[1000 rows x 6 columns]

In [17]:
x.drop(columns=['sat_v','sat_m','fy_gpa'], inplace=True)

In [18]:
x

     sex  sat_sum  hs_gpa
0      1      127    3.40
1      2      122    4.00
2      2      116    3.75
3      1       95    3.75
4      1      107    4.00
..   ...      ...     ...
995    2      100    3.70
996    1      108    3.30
997    1      114    3.50
998    1      120    2.30
999    1       93    2.70

[1000 rows x 3 columns]